Emacs.org
#+title Emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Setup
** Profile Emacs Startup
#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs loaded in %s."
                     (emacs-init-time))))
#+end_src
** Package System

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Install use-package
  (straight-use-package 'use-package)

  ;; Configure use-package to use straight.el by default
  (use-package straight
               :custom (straight-use-package-by-default t))
#+end_src
** OS X
*** OS X Meta rebinding
Changing the command key to be the META key in Emacs.

#+begin_src emacs-lisp
  (setq mac-command-modifier 'meta)
#+end_src

*** Env variables

A GNU Emacs library to ensure environment variables inside Emacs look the same as in the user's shell.
Particularly useful for OS X.
https://github.com/purcell/exec-path-from-shell

#+begin_src emacs-lisp
  ; Follow best practice by setting your environment variables so that they are available to both interactive and non-interactive shells. In practical terms, for most people this means setting them in ~/.profile, ~/.bash_profile, ~/.zshenv instead of ~/.bashrc and ~/.zshrc.
  (when (memq window-system '(mac ns x))
    (use-package exec-path-from-shell
      :init
      (setq exec-path-from-shell-arguments nil)
      (exec-path-from-shell-initialize))
    )

#+end_src

*** Make titlebar transparent
#+begin_src emacs-lisp
  ;;;; Make the titlebar on macOS transparent
  (when (eq system-type 'darwin)
    (use-package ns-auto-titlebar
      :init
      (ns-auto-titlebar-mode)))
#+end_src
* UI configuration
** General
#+begin_src emacs-lisp
  ;; Set up the visible bell
  (customize-set-variable 'visible-bell 1)

  ;; Improve scrolling
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
  (setq scroll-step 1) ;; keyboard scroll one line at a time
  (setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX

  ;; Make new buffers split vertically instead of horizontally
  ;; Taken from https://stackoverflow.com/a/2081978/3802589
  (setq split-height-threshold nil)
  (setq split-width-threshold 0)

  ;; Make it full screen on startup
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

** Make scrolling less stuttered
#+begin_src emacs-lisp
  (setq auto-window-vscroll nil)
  (customize-set-variable 'fast-but-imprecise-scrolling t)
  (customize-set-variable 'scroll-conservatively 101)
  (customize-set-variable 'scroll-margin 0)
  (customize-set-variable 'scroll-preserve-screen-position t)
#+end_src
** Theme

#+begin_src emacs-lisp
  (use-package doom-themes
    :init
    (disable-theme 'deeper-blue)
    (load-theme 'doom-snazzy t)
    (doom-themes-visual-bell-config)
    )
#+end_src

** Font

#+begin_src emacs-lisp
  (add-hook '
   emacs-startup-hook
   (lambda ()
              (custom-set-faces
               `(default ((t (:font "FiraCode Nerd Font" :weight light :height 120))))
               `(fixed-pitch ((t (:inherit (default)))))
               `(fixed-pitch-serif ((t (:inherit (default)))))
               `(variable-pitch ((t (:font "Iosevka Aile" :height 120 :weight light)))))))
#+end_src

** Helpful
#+begin_src emacs-lisp
  (use-package helpful
               :bind
               ([remap describe-function] . helpful-callable)
               ([remap describe-symbol] . helpful-symbol)
               ([remap describe-variable] . helpful-variable)
               ([remap describe-command] . helpful-command)
               ([remap describe-key] . helpful-key)
               ("C-h f" . helpful-function)
               )
#+end_src

** Modeline
*** Basic config

Set display time format.
#+begin_src emacs-lisp
  ;; Not sure if this is doing anything...
  (setq display-time-format "%l:%M %p %b %y"
        display-time-default-load-average nil)
#+end_src

Display column number in mode line.
#+begin_src emacs-lisp
  (column-number-mode)
#+end_src

*** Enable Mode Diminish

The [[https:https://github.com/myrjola/diminish.el][diminish]] package hides pesky minor modes from the modelines.

#+begin_src emacs-lisp
  (use-package diminish)
#+end_src

*** Doom modeline

#+begin_src emacs-lisp
  ;; Necessary for doom modeline
  (use-package all-the-icons)

  ;; Doom modeline
  ;; You must run (M-x all-the-icons-install-fonts) one time after
  ;; installing this package!
  ;; Not sure if necessary with the previous use-package call

  ;; Double check what this is for lol
  (use-package minions
    :hook (doom-modeline-mode . minions-mode))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :hook (after-init . doom-modeline-mode)
    :custom-face
    (mode-line ((t (:height 0.85))))
    (mode-line-inactive ((t (:height 0.85))))
    :custom
    (doom-modeline-height 15)
    (doom-modeline-bar-width 6)
    (doom-modeline-lsp t)
    (doom-modeline-minor-modes t)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    )
#+end_src

** Describe
#+begin_src emacs-lisp
  ;; Bind extra `describe-*' commands
  (global-set-key (kbd "C-h K") #'describe-keymap)
#+end_src

** Visual pulse when changing focus

Add visual pulse when changing focus, like beacon but built-in from https://karthinks.com/software/batteries-included-with-emacs/
#+begin_src emacs-lisp
  (defun pulse-line (&rest _)
    "Pulse the current line."
    (pulse-momentary-highlight-one-line (point)))

  (dolist (command '(scroll-up-command scroll-down-command
                                       recenter-top-bottom other-window))
    (advice-add command :after #'pulse-line))
#+end_src

* Editor
** Restore buffers as they were when closed
Apparently this clashes with Perspective own saved buffers and stuff.
#+begin_src emacs-lisp
(desktop-save-mode 1)
#+end_src

** Typed text replaces selection
#+begin_src emacs-lisp
  (delete-selection-mode 1)
#+end_src
** Display line number
#+begin_src emacs-lisp
  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src
** Transpose lines

#+begin_src emacs-lisp
  ;; Taken from https://github.com/anachronic/emacs.d/blob/master/elisp/setup-editor.el
  ;; Let's you transpose lines like IntelliJ
  (defun ach-move-line-up ()
    "Transpose the current line with the one above leaving the cursor in the first line."
    (interactive)
    (let ((col (current-column)))
      (transpose-lines 1)
      (forward-line -2)
      (move-beginning-of-line 1)
      (forward-char col)))


  (defun ach-move-line-down ()
    "Transpose the current line with the one below leaving the cursor in the first line."
    (interactive)
    (let ((col (current-column)))
      (forward-line 1)
      (transpose-lines 1)
      (forward-line -1)
      (move-beginning-of-line 1)
      (forward-char col)))

  (global-set-key (kbd "C-S-<up>") 'ach-move-line-up)
  (global-set-key (kbd "C-S-<down>") 'ach-move-line-down)
#+end_src

** Delete trailing whitespace on save
Not entirely sure how these two interact with each other
#+begin_src emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)

  ;; Automatically clean whitespaces
  ;; (use-package ws-butler
  ;;   :hook ((text-mode . ws-butler-mode)
  ;;          (prog-mode . ws-butler-mode)))
#+end_src

** Auto-save
#+begin_src emacs-lisp
  (use-package super-save
    :defer 1
    :diminish super-save-mode
    :config
    (super-save-mode +1)
    (setq super-save-auto-save-when-idle t))
#+end_src

** Fill column
#+begin_src emacs-lisp
  (setq-default fill-column 100)
#+end_src

** Disable tabs for spaces instead
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

** y-or-n
Use "y" and "n" to confirm/negate prompt instead of "yes" and "no".
Using `advice' here to make it easy to reverse in custom configurations with `(advice-remove 'yes-or-no-p #'y-or-n-p)'
#+begin_src emacs-lisp
  ;; N.B. Emacs 28 has a variable for using short answers, which should
  ;; be preferred if using that version or higher.
  (if (boundp 'use-short-answers)
      (setq use-short-answers t)
    (advice-add 'yes-or-no-p :override #'y-or-n-p))
#+end_src

** Do not save duplicates in kill-ring
#+begin_src emacs-lisp
  (customize-set-variable 'kill-do-not-save-duplicates t)
#+end_src

** Better support for files with long lines
#+begin_src emacs-lisp
  (setq-default bidi-paragraph-direction 'left-to-right)
  (setq-default bidi-inhibit-bpa t)
  (global-so-long-mode 1)
#+end_src

