Emacs.org
** Auto-reverting changed files
#+begin_src emacs-lisp
;; Revert Dired and other buffers
(customize-set-variable 'global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)
#+end_src

** Better parens
#+begin_src emacs-lisp
  (electric-pair-mode 1) ; auto-insert matching bracket
  (show-paren-mode 1) ; turn on paren match highlighting

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)
    )
#+end_src

* Completion
** Minibluffer backward kill
Copied from System Crafters (Crafted Emacs)
#+begin_src emacs-lisp
  (defun tdtron/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
  folder, otherwise delete a word"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
      (backward-kill-word arg)))
#+end_src
** Vertico
#+begin_src emacs-lisp
  (use-package vertico
    :init
    (vertico-mode)
    :custom
    (vertico-cycle t)
    )

  ;; Configure directory extension.
  (use-package vertico-directory
    :after vertico
    :straight nil
    :load-path "straight/repos/vertico/extensions/"
    :bind ( :map vertico-map
            ("RET" . vertico-directory-enter)
            ("DEL" . vertico-directory-delete-char)
            ("M-DEL" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

    (with-eval-after-load 'evil
      (define-key vertico-map (kbd "C-j") 'vertico-next)
      (define-key vertico-map (kbd "C-k") 'vertico-previous)
      (define-key vertico-map (kbd "M-h") 'vertico-directory-up))
#+end_src
** Marginalia
#+begin_src emacs-lisp
  (use-package marginalia
    :init
    (marginalia-mode)
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    )
#+end_src
** Consult
#+begin_src emacs-lisp
  (use-package consult
    :bind
    ("C-s" . consult-line)
    :config
    (define-key minibuffer-local-map (kbd "C-r") 'consult-history)
    (setq completion-in-region-function #'consult-completion-in-region)
    )
#+end_src
** Orderless
#+begin_src emacs-lisp
  (use-package orderless
    :custom
    (completion-styles '(orderless))
    (completion-category-overrides  '((file (styles . (partial-completion))))))
#+end_src
** Embark + Embark Consult
#+begin_src emacs-lisp
  (use-package embark
    :bind
    ("C-." . embark-act)
    ([remap describe-bindings] . embark-bindings)
    :config
    ;; Use Embark to show bindings in a key prefix with `C-h`
    (setq prefix-help-command #'embark-prefix-help-command)
    )

  (use-package embark-consult
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode)
    )
#+end_src
** Corfu
#+begin_src emacs-lisp
  ;; (use-package corfu-doc)

  (use-package corfu
      :init
      (global-corfu-mode)
      :custom
      (corfu-cycle t) ; Allows cycling through candidates
      (corfu-auto t)  ; Enable auto completion
      (corfu-auto-prefix 2) ; Complete with less prefix keys
      (corfu-auto-delay 0.0) ; No delay for completion
      (corfu-echo-documentation 0.25) ; Echo docs for current completion option

      :hook (corfu-mode . corfu-popupinfo-mode)

      :bind (:map corfu-map
                  ("M-p" . corfu-popupinfo-scroll-down)
                  ("M-n" . corfu-popupinfo-scroll-up)
                  ("M-d" . corfu-popupinfo-toggle))
      )

  (add-hook 'eshell-mode-hook
            (lambda () (setq-local corfu-quit-at-boundary t
                              corfu-quit-no-match t
                              corfu-auto nil)
              (corfu-mode)))
#+end_src
** Cape
#+begin_src emacs-lisp

  (use-package cape
    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    ;; Silence the pcomplete capf, no errors or messages!
    ;; Important for corfu
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

    ;; Ensure that pcomplete does not write to the buffer
    ;; and behaves as a pure `completion-at-point-function'.
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)
    )

#+end_src
* File Management
** Dired
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :straight nil
    :commands (dired dired-jump)

    :custom
    ; group-by-directory-first is not available in OS X apparently
    ; https://github.com/d12frosted/homebrew-emacs-plus/issues/383#issuecomment-899157143
    (setq insert-directory-program "gls" dired-use-ls-dired t)
    (setq dired-listing-switches "-agho --group-directories-first")
    (setq ;;dired-omit-files "^\\.[^.].*"
     dired-omit-verbose nil
     dired-hide-details-hide-symlink-targets nil
     delete-by-moving-to-trash t)
    :config
    (setq dired-dwim-target t)
    :bind ("C-x C-j" . dired-jump)
    )
#+end_src

Only have one buffer for dired
#+begin_src emacs-lisp
  (use-package dired-single)
#+end_src

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode)
    )
#+end_src

Hide files
#+begin_src emacs-lisp
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src
** Keeping emacs.d clean
#+begin_src emacs-lisp
  (use-package no-littering
    :custom
    (auto-save-file-name-transforms
     `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    (custom-file (expand-file-name "custom.el" user-emacs-directory))
    )
#+end_src
** Recent file
#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'recentf-mode)
  (global-set-key (kbd "C-M-e") 'recentf-open-files)
#+end_src
** Make shebang (#!) file executable when saved
#+begin_src emacs-lisp
  (add-hook 'after-save-hook #'executable-make-buffer-file-executable-if-script-p)
#+end_src

* Keybinds
** Keybinds panel (which-key)
#+begin_src emacs-lisp
  ;; (use-package which-key
  ;;   :init (which-key-mode)
  ;;   :diminish which-key-mode
  ;;   :config
  ;;   (setq which-key-idle-delay 0.3))
#+end_src

** General
#+begin_src emacs-lisp
    (use-package general
      :config
      (general-create-definer tdtron/leader-keys
        :keymaps '(normal insert visual emacs)
        :prefix "SPC"
        :global-prefix "C-SPC"
        )
      )

  ;; General purpose Toggles
    (tdtron/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tw" 'whitespace-mode
      "tt" '(load-theme :which-key "choose theme"))

    ;; Org-roam
    (with-eval-after-load 'org-roam-mode
      (tdtron/leader-keys
        "r" '(:ignore t :which-key "org-roam")
        "rl"  '(org-roam-buffer-toggle :which-key "buffer toggle")
        "rf" '(org-roam-node-find :which-key "find")
        "rg" '(org-roam-graph :which-key "graph")
        "ri" '(org-roam-node-insert :which-key "insert")
        "rI" '(org-roam-node-insert-immediate :which-key "insert immediate")
        "rc" '(org-roam-capture :which-key "capture")
        ;; Dailies
        "rj" '(org-roam-dailies-capture-today :which-key "capture today")
        "ry" '(org-roam-dailies-capture-yesterday :which-key "capture yesterday")
        )
      (define-key org-mode-map (kbd "C-M-i") 'completion-at-point)
      )

    ;; Magit
    (with-eval-after-load 'magit
      (tdtron/leader-keys
        "g"   '(:ignore t :which-key "git")
        "gs"  'magit-status
        "gd"  'magit-diff-unstaged
        "gc"  'magit-branch-or-checkout
        "gl"   '(:ignore t :which-key "log")
        "glc" 'magit-log-current
        "glf" 'magit-log-buffer-file
        "gb"  'magit-branch
        "gP"  'magit-push-current
        "gp"  'magit-pull-branch
        "gf"  'magit-fetch
        "gF"  'magit-fetch-all
        "gr"  'magit-rebase)
      )
#+end_src

