init.el

;; Revert Dired and other buffers
(customize-set-variable 'global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

(electric-pair-mode 1) ; auto-insert matching bracket
(show-paren-mode 1) ; turn on paren match highlighting

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  )

(defun tdtron/minibuffer-backward-kill (arg)
  "When minibuffer is completing a file name delete up to parent
folder, otherwise delete a word"
  (interactive "p")
  (if minibuffer-completing-file-name
      ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
      (if (string-match-p "/." (minibuffer-contents))
          (zap-up-to-char (- arg) ?/)
        (delete-minibuffer-contents))
    (backward-kill-word arg)))

(use-package vertico
  :init
  (vertico-mode)
  :custom
  (vertico-cycle t)
  )

;; Configure directory extension.
(use-package vertico-directory
  :after vertico
  :straight nil
  :load-path "straight/repos/vertico/extensions/"
  :bind ( :map vertico-map
          ("RET" . vertico-directory-enter)
          ("DEL" . vertico-directory-delete-char)
          ("M-DEL" . vertico-directory-delete-word))
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

  (with-eval-after-load 'evil
    (define-key vertico-map (kbd "C-j") 'vertico-next)
    (define-key vertico-map (kbd "C-k") 'vertico-previous)
    (define-key vertico-map (kbd "M-h") 'vertico-directory-up))

(use-package marginalia
  :init
  (marginalia-mode)
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  )

(use-package consult
  :bind
  ("C-s" . consult-line)
  :config
  (define-key minibuffer-local-map (kbd "C-r") 'consult-history)
  (setq completion-in-region-function #'consult-completion-in-region)
  )

(use-package orderless
  :custom
  (completion-styles '(orderless))
  (completion-category-overrides  '((file (styles . (partial-completion))))))

(use-package embark
  :bind
  ("C-." . embark-act)
  ([remap describe-bindings] . embark-bindings)
  :config
  ;; Use Embark to show bindings in a key prefix with `C-h`
  (setq prefix-help-command #'embark-prefix-help-command)
  )

(use-package embark-consult
  :after (embark consult)
  :demand t ; only necessary if you have the hook below
  ;; if you want to have consult previews as you move around an
  ;; auto-updating embark collect buffer
  :hook
  (embark-collect-mode . consult-preview-at-point-mode)
  )

;; (use-package corfu-doc)

(use-package corfu
    :init
    (global-corfu-mode)
    :custom
    (corfu-cycle t) ; Allows cycling through candidates
    (corfu-auto t)  ; Enable auto completion
    (corfu-auto-prefix 2) ; Complete with less prefix keys
    (corfu-auto-delay 0.0) ; No delay for completion
    (corfu-echo-documentation 0.25) ; Echo docs for current completion option

    :hook (corfu-mode . corfu-popupinfo-mode)

    :bind (:map corfu-map
                ("M-p" . corfu-popupinfo-scroll-down)
                ("M-n" . corfu-popupinfo-scroll-up)
                ("M-d" . corfu-popupinfo-toggle))
    )

(add-hook 'eshell-mode-hook
          (lambda () (setq-local corfu-quit-at-boundary t
                            corfu-quit-no-match t
                            corfu-auto nil)
            (corfu-mode)))

(use-package cape
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  ;; Silence the pcomplete capf, no errors or messages!
  ;; Important for corfu
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

  ;; Ensure that pcomplete does not write to the buffer
  ;; and behaves as a pure `completion-at-point-function'.
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)
  )

(use-package dired
  :ensure nil
  :straight nil
  :commands (dired dired-jump)

  :custom
  ; group-by-directory-first is not available in OS X apparently
  ; https://github.com/d12frosted/homebrew-emacs-plus/issues/383#issuecomment-899157143
  (setq insert-directory-program "gls" dired-use-ls-dired t)
  (setq dired-listing-switches "-agho --group-directories-first")
  (setq ;;dired-omit-files "^\\.[^.].*"
   dired-omit-verbose nil
   dired-hide-details-hide-symlink-targets nil
   delete-by-moving-to-trash t)
  :config
  (setq dired-dwim-target t)
  :bind ("C-x C-j" . dired-jump)
  )

(use-package dired-single)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  )

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(use-package no-littering
  :custom
  (auto-save-file-name-transforms
   `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  (custom-file (expand-file-name "custom.el" user-emacs-directory))
  )

(add-hook 'after-init-hook #'recentf-mode)
(global-set-key (kbd "C-M-e") 'recentf-open-files)

(add-hook 'after-save-hook #'executable-make-buffer-file-executable-if-script-p)

;; (use-package which-key
;;   :init (which-key-mode)
;;   :diminish which-key-mode
;;   :config
;;   (setq which-key-idle-delay 0.3))

(use-package general
    :config
    (general-create-definer tdtron/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"
      )
    )

;; General purpose Toggles
  (tdtron/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tw" 'whitespace-mode
    "tt" '(load-theme :which-key "choose theme"))

  ;; Org-roam
  (with-eval-after-load 'org-roam-mode
    (tdtron/leader-keys
      "r" '(:ignore t :which-key "org-roam")
      "rl"  '(org-roam-buffer-toggle :which-key "buffer toggle")
      "rf" '(org-roam-node-find :which-key "find")
      "rg" '(org-roam-graph :which-key "graph")
      "ri" '(org-roam-node-insert :which-key "insert")
      "rI" '(org-roam-node-insert-immediate :which-key "insert immediate")
      "rc" '(org-roam-capture :which-key "capture")
      ;; Dailies
      "rj" '(org-roam-dailies-capture-today :which-key "capture today")
      "ry" '(org-roam-dailies-capture-yesterday :which-key "capture yesterday")
      )
    (define-key org-mode-map (kbd "C-M-i") 'completion-at-point)
    )

  ;; Magit
  (with-eval-after-load 'magit
    (tdtron/leader-keys
      "g"   '(:ignore t :which-key "git")
      "gs"  'magit-status
      "gd"  'magit-diff-unstaged
      "gc"  'magit-branch-or-checkout
      "gl"   '(:ignore t :which-key "log")
      "glc" 'magit-log-current
      "glf" 'magit-log-buffer-file
      "gb"  'magit-branch
      "gP"  'magit-push-current
      "gp"  'magit-pull-branch
      "gf"  'magit-fetch
      "gF"  'magit-fetch-all
      "gr"  'magit-rebase)
    )
