init.el

(use-package hydra)


(with-eval-after-load 'coq-mode
  (defhydra hydra-coq ()
    "Coq actions"
    ("j" proof-assert-next-command-interactive "Next")
    ("k" proof-undo-last-successful-command "Undo")
    ("f" nil "finished" :exit t)
    )
  (tdtron/leader-keys
    "c"   '(:ignore t :which-key "coq")
    "cs"  '(coq-Search :which-key "search")
    "ci"  '(hydra-coq/body :which-key "interactive")
    ))

(defhydra hydra-text-scale (:timeout 5)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t)
  )

(tdtron/leader-keys
  "c"   '(:ignore t :which-key "coq")
  "cs"  '(coq-Search :which-key "search")
  "ci"  '(hydra-coq/body :which-key "interactive")
  )

(tdtron/leader-keys
  "s" '(hydra-text-scale/body :which-key "scale text"))

;; Sets initial evil mode to emacs for these modes
(defun tdtron/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))


  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)

    :hook (evil-mode . tdtron/evil-hook)
    :custom
    ;; C-h is backspace in insert state
    (customize-set-variable 'evil-want-C-h-delete t)

    :config
    (evil-mode 1)
    ;; Make C-g revert to normal state
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Make evil search more like vim
    (evil-select-search-module 'evil-search-module 'evil-search)

    ;; Rebind `universal-argument' to 'C-M-u' since 'C-u' now scrolls the buffer
    (global-set-key (kbd "C-M-u") 'universal-argument)
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  ;; Turn on undo-tree globally
  (when (< emacs-major-version 28)
    (use-package undo-tree
      :after evil
      :init
      (global-undo-tree-mode 1)
      :config
      (setq undo-tree-auto-save-history nil)))

  (if (< emacs-major-version 28)
      (customize-set-variable 'evil-undo-system 'undo-tree)
    (customize-set-variable 'evil-undo-system 'undo-redo))

(use-package evil-collection
  :after evil
       ; (setq evil-collection-company-use-tng nil)  ;; Is this a bug in evil-collection?
  :custom
       (evil-collection-outline-bind-tab-p nil)
       :config
       (setq evil-collection-mode-list
             (remove 'lispy evil-collection-mode-list))
       (evil-collection-init))

(use-package evil-nerd-commenter
  :init
  ;; Turn on Evil Nerd Commenter
  (evilnc-default-hotkeys))


(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

(defun tdtron/org-font-setup ()
   ;; Replace list hyphen with dot
   (font-lock-add-keywords 'org-mode
                           '(("^ *\\([-]\\) "
                              (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

   ;; Set faces for heading levels
   (dolist (face '((org-level-1 . 1.2)
                   (org-level-2 . 1.1)
                   (org-level-3 . 1.05)
                   (org-level-4 . 1.0)
                   (org-level-5 . 1.1)
                   (org-level-6 . 1.1)
                   (org-level-7 . 1.1)
                   (org-level-8 . 1.1)))
     (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face)))

   ;; Ensure that anything that should be fixed-pitch in Org files appears that way
   (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
   (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
   (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
   (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
   (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
   (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
   (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
   (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
   (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
   (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
   (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

;; Tangle on save
 (defun org-babel-tangle-config ()
   (when (string-equal (buffer-file-name)
                       (expand-file-name "Emacs.org"
                                         (expand-file-name "Projects/dotfiles" (getenv "HOME"))))
     ;; Dynamic scoping to the rescue
     (let ((org-confirm-babel-evaluate nil))
       (org-babel-tangle))))

 ;; Turn on indentation and auto-fill mode for Org files
 (defun tdtron/org-mode-setup ()
   (org-indent-mode)
   (variable-pitch-mode 1)
   (auto-fill-mode 0)
   (visual-line-mode 1)
   (diminish org-indent-mode)
   )

 (use-package org
   :defer t
   :commands (org-capture org-agenda)
   :hook (org-mode . tdtron/org-mode-setup)
   :hook (org-mode . (lambda ()
                       (add-hook 'after-save-hook #'org-babel-tangle-config)))
   :hook (org-mode . org-toggle-pretty-entities)
   ;; Consider using :custom instead and not setq
   :config
   (setq org-ellipsis " ▾"
         org-hide-emphasis-markers t
         org-src-fontify-natively t
         org-fontify-quote-and-verse-blocks t
         org-src-tab-acts-natively t
         org-edit-src-content-indentation 2
         org-hide-block-startup nil
         org-src-preserve-indentation nil
         org-startup-folded 'content
         org-cycle-separator-lines 2)
   (tdtron/org-font-setup)

   :custom
   ;; Check whether it's worth having this shift support
   (org-support-shift-select t)
   ;; Return or left-click with mouse follows link
   (org-return-follows-link t)
   (org-mouse-1-follows-link t)
   ;; Display links as the description provided
   (org-link-descriptive t)
   ;; Hide markup markers
   (org-hide-emphasis-markers t)
   (org-entities-user
    '(("square" "\\square" t "&#9633" "■" "" "□")
      ("sqsubseteq" "\\sqsubseteq" t "&#2291" "⊑" "" "⊑")))
   )

;; Change headers * for other symbols
 (use-package org-superstar
   :after org
   :hook (org-mode . org-superstar-mode)
   :custom
   (org-superstar-remove-leading-stars t)
   (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))


 (defun tdtron/org-mode-visual-fill ()
   (setq visual-fill-column-width 110
         visual-fill-column-center-text t)
   (visual-fill-column-mode 1))

 (use-package visual-fill-column
   :defer t
   :hook (org-mode . tdtron/org-mode-visual-fill))

(use-package org-appear
  :hook (org-mode . org-appear-mode))

;; (use-package org-download)

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     ;; Coq apparently is not working with Babel - https://emacs.stackexchange.com/q/58369/34589
     ;; With newer Coq versions, the file 'coq-inferior.el' is no longer packaged with it
     ;; (coq . t)
     )
   )
  )

(with-eval-after-load 'org
