Emacs.org
** Configure templates

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    ;; See org lang load - TLDR: Coq is not working with babel rn
    (add-to-list 'org-structure-template-alist '("coq" . "src coq"))
    )
#+end_src

* Org Roam
#+begin_src emacs-lisp
  ;; Let's you insert without confirming.
  ;; Uses the first template for the immediate nodes (ie. default right now)
  ;; Source: https://systemcrafters.net/build-a-second-brain-in-emacs/5-org-roam-hacks/
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))

  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)

    :config
    (org-roam-db-autosync-mode)

    :custom
    (org-roam-directory "~/Projects/Notes")
    (org-roam-completion-everywhere t)
    (org-roam-completion-system 'default)
    (org-roam-capture-templates
     '(("d" "default" plain "%?"
        :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n")
        :unnarrowed t)

       ("p" "Paper" plain
        (file "~/Projects/Notes/templates/PaperTemplate.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+filetags: Paper")
        :unnarrowed t)

       ("q" "Question" plain
        (file "~/Projects/Notes/templates/QuestionTemplate.org")
        :if-new (file+head "~/Projects/Notes/questions/%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+filetags: Question")
        :unnarrowed t)

       )
     )
    )
#+end_src

#+begin_src emacs-lisp
  ;; (use-package org-roam-ui
  ;;   ;; :straight
  ;;   ;;   (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
  ;;     :after org-roam
  ;; ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;; ;;         a hookable mode anymore, you're advised to pick something yourself
  ;; ;;         if you don't care about startup time, use
  ;; ;;  :hook (after-init . org-roam-ui-mode)
  ;;     :config
  ;;     (setq org-roam-ui-sync-theme t
  ;;           org-roam-ui-follow t
  ;;           org-roam-ui-update-on-save t
  ;;           org-roam-ui-open-on-start t))

#+end_src

* Productivity
** Syntax checking
#+begin_src emacs-lisp
  ;; Syntax check
  ;; (use-package flycheck
  ;;   :defer t
  ;;   :hook (coq-mode . flycheck-mode))
#+end_src
** Snippets
#+begin_src emacs-lisp
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode)
    :config
    (yas-reload-all))
#+end_src
** Save minibuffer history
#+begin_src emacs-lisp
  (savehist-mode 1)
#+end_src
** Save last cursor location
#+begin_src emacs-lisp
  (save-place-mode 1)
#+end_src

* Development
** LSP
#+begin_src emacs-lisp
;; (defun tdtron/lsp-mode-setup ()
;;   (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
;;   (lsp-headerline-breadcrumb-mode))

;; (use-package lsp-mode
;;   :commands (lsp lsp-deferred)
;;   :hook (lsp-mode . tdtron/lsp-mode-setup)
;;   :init
;;   (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
;;   :config
;;   (lsp-enable-which-key-integration t))
#+end_src

#+begin_src emacs-lisp
;; (use-package lsp-ui
;;   :hook (lsp-mode . lsp-ui-mode)
;;   :custom
;;   (lsp-ui-doc-position 'bottom))
#+end_src

#+begin_src emacs-lisp
  ;; (use-package lsp-treemacs
  ;;   :after lsp)
#+end_src

#+begin_src emacs-lisp
  ;; (use-package lsp-ivy)
#+end_src

#+begin_src emacs-lisp
  ;; (use-package company
  ;;   :after lsp-mode
  ;;   :hook (lsp-mode . company-mode)
  ;;   :bind (:map company-active-map
  ;;          ("<tab>" . company-complete-selection))
  ;;         (:map lsp-mode-map
  ;;          ("<tab>" . company-indent-or-complete-common))
  ;;   :custom
  ;;   (company-minimum-prefix-length 1)
  ;;   (company-idle-delay 0.0))

  ;; (use-package company-box
  ;;   :hook (company-mode . company-box-mode))
#+end_src

** Project management
#+begin_src emacs-lisp
  ;; (defun tdtron/switch-project-action ()
  ;;   "Switch to a workspace with the project name and start `magit-status'."
  ;;   ;; TODO: Switch to EXWM workspace 1?
  ;;   (persp-switch (projectile-project-name))
  ;;   (magit-status))

  ;; (use-package projectile
  ;;   :diminish projectile-mode
  ;;   :config (projectile-mode)
  ;;   :demand t
  ;;   :bind ("C-M-o" . projectile-find-file)
  ;;   :bind-keymap
  ;;   ("C-c p" . projectile-command-map)

  ;;   :init
  ;;   (when (file-directory-p "~/Projects")
  ;;     (setq projectile-project-search-path '("~/Projects")))
  ;;   (setq projectile-switch-project-action #'tdtron/switch-project-action)
  ;;   ;; (setq projectile-switch-project-action #'projectile-dired)

  ;;   )

  ;; (use-package counsel-projectile
  ;;   :after projectile
  ;;   :config
  ;;   (counsel-projectile-mode)
  ;;   :bind ("C-S-f" . counsel-projectile-rg)
  ;;   )
#+end_src
** Git
#+begin_src emacs-lisp
  (use-package magit
    :bind ("C-M-;" . magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

    ;; Forge
  ;;   ;; (use-package forge)

#+end_src

** Coq

#+begin_src emacs-lisp
  (use-package proof-general
    :config
    (setq proof-three-window-mode-policy 'hybrid) ;; Set default layout to hybrid
    )

  (use-package company-coq
    :hook
    ;; Load company-coq when opening Coq files
    (coq-mode . company-coq-mode))
#+end_src
** Emacs Lisp
*** <esc> escapes prompts
#+begin_src emacs-lisp
  ;; (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
** Ocaml
#+begin_src emacs-lisp
;; (use-package tuareg)
#+end_src
** Racket
#+begin_src emacs-lisp
  ;; (use-package racket-mode
  ;;              :mode "\\.rkt\\'"
  ;;   :hook (racket-mode . racket-xp-mode)   )
#+end_src
#+begin_src emacs-lisp
  ;; (with-eval-after-load 'lsp-mode
  ;;   (require 'lsp-racket)
  ;;   (add-hook 'racket-mode-hook #'lsp))
#+end_src
